-- Створення таблиці для зберігання інформації про поїзди
CREATE TABLE IF NOT EXISTS trains (
    id INTEGER PRIMARY KEY,
    from_station TEXT,
    to_station TEXT,
    departure_time TEXT,
    arrival_time TEXT,
    price REAL,
    available_seats INTEGER
);

-- Вставка даних про поїзди
INSERT INTO trains (id, from_station, to_station, departure_time, arrival_time, price, available_seats)
VALUES
    (1, 'Київ', 'Львів', '08:00', '15:30', 100.0, 10),
    (2, 'Львів', 'Київ', '16:00', '23:30', 100.0, 5),
    (3, 'Харків', 'Київ', '08:00', '11:25', 150.0, 10),
    (4, 'Київ', 'Харків', '15:30', '18:55', 150.0, 10),
    (5, 'Харків', 'Львів', '08:00', '18:30', 250.0, 10),
    (6, 'Львів', 'Харків', '20:00', '06:30', 250.0, 10),
    (7, 'Київ', 'Одеса', '07:30', '17:30', 200.0, 10),
    (8, 'Одеса', 'Київ', '16:30', '02:30', 200.0, 10),
    (9, 'Київ', 'Вінниця', '08:00', '15:30', 150.0, 10),
    (10, 'Вінниця', 'Київ', '15:30', '08:00', 150.0, 10),
    (11, 'Київ', 'Полтава', '08:00', '10:30', 100.0, 10),
    (12, 'Полтава', 'Київ', '11:00', '13:30', 100.0, 10),
    (13, 'Полтава', 'Харків', '06:45', '08:45', 175.0, 10),
    (14, 'Харків', 'Полтава', '09:00', '11:00', 175.0, 10),
    (15, 'Кропивницький', 'Київ', '11:10', '18:30', 190.0, 10),
    (16, 'Київ', 'Кропивницький', '19:10', '2:30', 190.0, 10),
    (17, 'Маріуполь', 'Київ', '08:00', '15:30', 160.0, 10),
    (18, 'Київ', 'Маріуполь', '16:00', '23:30', 160.0, 10),
    (19, 'Миколаїв', 'Одеса', '10:25', '15:30', 75.0, 10),
    (20, 'Одеса', 'Миколаїв', '16:00', '21:05', 100.0, 10);